<!DOCTYPE html>

<html lang="zh-CN"  class="">


<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <meta name="keywords" content="">
    
    
    <meta name="description" content="">
    
    <meta name="generator" content="teedoc">
    <meta name="theme" content="teedoc-plugin-theme-default">
    
        
        <meta name="markdown-generator" content="teedoc-plugin-markdown-parser">
        
        <script>
MathJax = {"loader": {"load": ["output/svg"]}, "tex": {"inlineMath": [["$", "$"], ["\\(", "\\)"]]}, "svg": {"fontCache": "global"}};
</script>
        
        <script id="MathJax-script" async src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
        
        <script src="/static/js/theme_default/pre_main.js"></script>
        
        <link rel="stylesheet" href="/static/css/theme_default/prism.min.css" type="text/css"/>
        
        <link rel="stylesheet" href="/static/css/theme_default/viewer.min.css" type="text/css"/>
        
        <link rel="stylesheet" href="/static/css/theme_default/dark.css" type="text/css"/>
        
        <link rel="stylesheet" href="/static/css/theme_default/light.css" type="text/css"/>
        
        <script src="/static/js/theme_default/jquery.min.js"></script>
        
        <script src="/static/js/theme_default/split.js"></script>
        
        <link rel="stylesheet" href="/static/css/search/style.css" type="text/css"/>
        
        <link rel="stylesheet" href="/static/css/custom.css" type="text/css"/>
        
    
    
    <title>关于C++继承中的virtual以及虚指针、虚表 - Fingsinz's Space</title>
    
    <script type="text/javascript">js_vars = {}</script>
    <script type="text/javascript">metadata = {"tags": ["CPP"], "date": "2024-08-07", "update": [], "ts": 1723010982, "author": "", "brief": "", "cover": null, "categories": "日常", "math": null}</script>
</head>


<body class="type_doc">
    
    <div id="navbar">
        <div id="navbar_menu">
            <a class="site_title" href="/">
                
                    <img class="site_logo" src="/static/images/logo.webp" alt="logo">
                
                
                    <h2>Fingsinz's Space</h2>
                
        </a>
            <a id="navbar_menu_btn"></a>
        </div>
        <div id="navbar_items">
            <div>
                <ul id="nav_left">
<li class="active"><a  href="/articals/">随笔记录</a></li>
<li class=""><a  href="/notes/">学习笔记</a></li>
<li class=""><a  href="/collections/">收藏</a></li>
<li class=""><a  href="/about/">关于我</a></li>
</ul>

            </div>
            <div>
                <ul id="nav_right">
</ul>

                <ul class="nav_plugins"><li><a id="themes" class="light"></a></li></ul><ul class="nav_plugins"><li><a id="search"><span class="icon"></span><span class="placeholder">Search</span>
                            <div id="search_hints">
                                <span id="search_input_hint">Keywords separated by space</span>
                                <span id="search_loading_hint">Loading, wait please ...</span>
                                <span id="search_download_err_hint">Download error, please check network and refresh again</span>
                                <span id="search_other_docs_result_hint">Result from other docs</span>
                                <span id="search_curr_doc_result_hint">Result from current doc</span>
                            </div></a></li></ul>
            </div>
        </div>
    </div>
    
    <div id="wrapper">
        <div id="sidebar_wrapper">
            <div id="sidebar">
                <div id="sidebar_title">
                    
                </div>
                <ul class="">
<li class="not_active with_link"><a href="/articals/index.html"><span class="label">Brief</span><span class=""></span></a></li>
</ul>

            </div>
        </div>
        <div id="article">
            <div id="menu_wrapper">
                <div id="menu">
                </div>
            </div>
            <div id="content_wrapper">
                <div id="content_body">
                    <div id="article_head">
                        <div id="article_title">
                            
                            <h1>关于C++继承中的virtual以及虚指针、虚表</h1>
                            
                        </div>
                        <div id="article_tags">
                            <ul>
                            
                                <li>CPP</li>
                            
                            </ul>
                        </div>
                        <div id="article_info">
                        <div id="article_info_left">
                            <span class="article_author">
                                
                            </span>
                            
                                <span class="article_date" title="最后修改日期： 2024-08-07">
                                    2024-08-07
                                </span>
                            
                        </div>
                        <div id="article_info_right">
                            
                        </div>
                        </div>
                    </div>
                    <div id="article_tools">
                        <span></span>
                        <span id="toc_btn"></span>
                    </div>
                    <div id="update_history">
                        
                    </div>
                    <div id="article_content">
                        
                            <p>关键词：C++</p>
<!-- more -->
<hr />
<p>在使用 C++ 类的继承时，经常会使用到 <code>virtual</code> 关键字，无论是声明 <strong>虚函数</strong> 还是 <strong>虚继承</strong>。</p>
<h2 id="%E5%9F%BA%E7%A1%80%E6%A6%82%E5%BF%B5">基础概念</h2>
<p><code>virtual</code> 说明符指定非静态成员函数为虚函数并支持动态调用派发。</p>
<h3 id="%E8%99%9A%E5%87%BD%E6%95%B0">虚函数</h3>
<p>虚函数是可在派生类中覆盖其行为的成员函数，解决函数重名（重写）的调用问题。</p>
<ul>
<li>与非虚函数相反，即使没有关于该类实际类型的编译时信息，仍然保留被覆盖的行为。</li>
<li>当使用到基类的指针或引用来处理派生类时，对被覆盖的虚函数的调用，将会调用定义于派生类中（重写）的函数版本。</li>
<li>当使用有限定名字查找（即函数名出现在作用域解析运算符 <code>::</code> 的右侧）时，使用的是限定查找的函数版本。</li>
</ul>
<p>如：</p>

<pre class="language-cpp"><code class="language-cpp">#include &lt;iostream&gt;

class Base {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;base\n&quot;;
    }
};

class Derived : public Base {
public:
    void f() override {
    	std::cout &lt;&lt; &quot;derived\n&quot;;
    }
};

int main() {
    Base b;
    Derived d;

    // 通过引用调用虚函数
    Base &amp;br = b;
    Base &amp;dr = d;
    br.f(); // base
    dr.f(); // derived

    // 通过指针调用虚函数
    Base *bp = &amp;b;
    Base *dp = &amp;d;
    bp-&gt;f(); // base
    dp-&gt;f(); // derived

    // 非虚函数调用
    br.Base::f(); // base
    dr.Base::f(); // base
    return 0;
}
</code></pre>
<p>注意要把父类的析构函数声明为虚函数，这样子类析构时会正确调用子类的析构函数，避免了内存泄漏的风险。</p>
<h4 id="%E8%99%9A%E5%87%BD%E6%95%B0%E6%8C%87%E9%92%88%E5%92%8C%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8">虚函数指针和虚函数表</h4>
<p>虚函数指针（vfptr）指向一个虚函数表（vftable），虚函数表记录了虚函数的地址。</p>
<p>虚表是属于类的，一个类只需要一个虚表即可，同一个类的所有对象都使用同一个虚表。</p>
<h3 id="%E8%99%9A%E7%BB%A7%E6%89%BF">虚继承</h3>
<p>虚继承解决的是 C++ 多重继承带来的问题。</p>
<ul>
<li>从不同途径继承来的同一基类，会在子类中存在多份拷贝，既浪费存储空间，也存在二义性。</li>
</ul>
<p>虚继承底层实现与编译器相关，一般通过虚基指针和虚基表实现。</p>
<ul>
<li>每个虚继承的子类都有一个虚基类指针（占用一个指针的存储空间）和虚基类表（不占用类对象的存储空间）。</li>
</ul>
<h4 id="%E8%99%9A%E5%9F%BA%E6%8C%87%E9%92%88%E5%92%8C%E8%99%9A%E5%9F%BA%E8%A1%A8">虚基指针和虚基表</h4>
<p>虚基指针（vbptr）指向一个虚基表（vbtable），虚基表记录了虚基类与本类的偏移地址，通过偏移地址找到虚基类成员，而不用持有拷贝浪费空间。</p>
<p>与虚函数指针和虚函数表相比：</p>
<ul>
<li>虚基类依旧存在继承类中，占用存储空间；虚函数不占用存储空间。</li>
<li>虚基类表存储的是虚基类相对直接继承类的偏移；而虚函数表存储的是虚函数地址。</li>
</ul>
<h2 id="%E4%BB%8E%E5%86%85%E5%AD%98%E5%B8%83%E5%B1%80%E7%9C%8B">从内存布局看</h2>
<h3 id="%E6%97%A0%E7%BB%A7%E6%89%BF">无继承</h3>
<p>单纯一个类时：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int m_a;
};
</code></pre>
<p>VS 所输出内存布局为：</p>

<pre class="language-none"><code class="language-none">class A	size(4):
    +---
 0	| m_a
    +---
</code></pre>
<p>内存大小为一个 <code>int</code> 变量的大小。</p>
<h3 id="%E5%8D%95%E7%BB%A7%E6%89%BF">单继承</h3>
<h4 id="1.%E9%9D%9E%E8%99%9A%E7%BB%A7%E6%89%BF%E6%97%A0%E8%99%9A%E5%87%BD%E6%95%B0">1.非虚继承无虚函数</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
};

class B : public A {
public:
    void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
};
</code></pre>
<p>基类 A 的内存布局：</p>

<pre class="language-none"><code class="language-none">class A	size(4):
    +---
 0	| m_a
    +---
</code></pre>
<ul>
<li>在数据区域，不存在 <code>{vfptr}</code> 虚函数指针，只存在 <code>m_a</code> 变量（4 字节）。所以占内存 4 字节。</li>
</ul>
<p>派生类 B 的内存布局：</p>

<pre class="language-none"><code class="language-none">class B	size(8):
    +---
 0	| +--- (base class A)
 0	| | m_a		基类数据成员
    | +---
 4	| m_b		子类数据成员
    +---
</code></pre>
<ul>
<li>在数据区域，不存在 <code>{vfptr}</code> 虚函数指针，只存在 <code>m_b</code> 变量（4 字节）和继承得到的 <code>m_a</code> 变量，所以占内存 8 字节。</li>
</ul>
<p>结果：</p>
<ul>
<li>由于不存在虚函数表，故并不会调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="2.%E9%9D%9E%E8%99%9A%E7%BB%A7%E6%89%BF%E6%9C%89%E8%99%9A%E5%87%BD%E6%95%B0">2.非虚继承有虚函数</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int m_a;
};

class B : public A {
public:
    void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
private:
    int m_b;
};
</code></pre>
<p>基类 A 的内存布局：</p>

<pre class="language-none"><code class="language-none">class A	size(16):
    +---
 0	| {vfptr}
 8	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
A::$vftable@:
    | &amp;A_meta
    |  0
 0	| &amp;A::f
</code></pre>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节）。同时进行内存对齐（+4 字节），所以占内存 16 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>。</li>
</ul>
<p>子类 B 的内存布局：</p>

<pre class="language-none"><code class="language-none">class B	size(24):
    +---
 0	| +--- (base class A)
 0	| | {vfptr}		虚函数指针
 8	| | m_a			基类数据成员
    | | &lt;alignment member&gt; (size=4)
    | +---
16	| m_b			子类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
B::$vftable@:		虚函数表
    | &amp;B_meta
    |  0
 0	| &amp;B::f
</code></pre>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节），同样进行内存对齐（+4 字节），再加上子类自身的成员变量 <code>m_b</code> （4 字节），再加以内存对齐（+4 字节），所以占内存 24 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>，指明了函数版本。</li>
</ul>
<p>结果：</p>
<ul>
<li>虚函数表指明了函数版本，调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="3.%E8%99%9A%E7%BB%A7%E6%89%BF%E6%97%A0%E8%99%9A%E5%87%BD%E6%95%B0">3.虚继承无虚函数</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int m_a;
};

class B : virtual public A {
public:
    void f() {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
private:
    int m_b;
};
</code></pre>
<p>父类 A 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class A	size(4):
    +---
 0	| m_a
    +---
</code></pre>
<ul>
<li>只有数据区域的变量。</li>
</ul>
<p>子类 B 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class B	size(24):
    +---
 0	| {vbptr}		虚基指针
 8	| m_b			子类数据成员
    | &lt;alignment member&gt; (size=4)
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
16	| m_a			基类数据成员
    +---
B::$vbtable@:
 0	| 0
 1	| 16 (Bd(B+0)A)		表示类 B 的虚基类 A 位于偏移 16 + 0 = 16 处
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      16       0       4 		0
</code></pre>
<ul>
<li>在数据区域，存在虚基指针 <code>{vbptr}</code>，且虚基类位于子类存储空间的末尾。</li>
<li>存在虚基表 <code>{vbtable}</code>。</li>
</ul>
<p>结果：</p>
<ul>
<li>由于不存在虚函数表，不会调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="4.%E8%99%9A%E7%BB%A7%E6%89%BF%E6%9C%89%E8%99%9A%E5%87%BD%E6%95%B0">4.虚继承有虚函数</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int m_a;
};

class B : virtual public A {
public:
    void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
private:
    int m_b;
};
</code></pre>
<p>父类 A 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class A	size(16):
    +---
 0	| {vfptr}
 8	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
A::$vftable@:
    | &amp;A_meta
    |  0
 0	| &amp;A::f
</code></pre>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节）。同时进行内存对齐（+4 字节），所以占内存 16 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>。</li>
</ul>
<p>子类 B 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class B	size(32):
    +---
 0	| {vbptr}		虚基指针
 8	| m_b			子类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
16	| {vfptr}		虚基类虚函数指针
24	| m_a			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
B::$vbtable@:
 0	| 0
 1	| 16 (Bd(B+0)A)		表示类 B 的虚基类 A 位于偏移 16 + 0 = 16 处
B::$vftable@:
    | -16
 0	| &amp;B::f
B::f this adjustor: 16
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      16       0       4 		0
</code></pre>
<ul>
<li>在数据区域，存在 <code>{vbptr}</code> 虚基指针 和 <code>{vfptr}</code> 虚函数指针。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>，指明了函数版本。</li>
<li>如果派生类没有独立的虚函数，此时派生类对象不会产生虚函数指针。</li>
</ul>
<hr />
<p>若派生类中有独立的虚函数，会产生虚函数指针：</p>
<p>如下情形：</p>

<pre class="language-cpp"><code class="language-cpp">class B : virtual public A {
public:
    void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }

    virtual void f1() {	// 派生类中独立的虚函数
    	std::cout &lt;&lt; &quot;tmp\n&quot;;
    }
private:
    int m_b;
};
</code></pre>
<p>导致内存布局为：</p>

<pre class="language-none"><code class="language-none">class B	size(40):
    +---
 0	| {vfptr}		虚函数指针
 8	| {vbptr}		虚基指针
16	| m_b			子类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
24	| {vfptr}		虚基类虚函数指针
32	| m_a			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
B::$vftable@B@:		类 B 的虚函数表
    | &amp;B_meta
    |  0
 0	| &amp;B::f1
B::$vbtable@:
 0	| -8
 1	| 16 (Bd(B+8)A)		表示类 B 的虚基类 A 位于偏移 16 + 8 = 24 处
B::$vftable@A@:		类 A 的虚函数表
    | -24
 0	| &amp;B::f
B::f this adjustor: 24
B::f1 this adjustor: 0
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      24       8       4 		0
</code></pre>
<ul>
<li>如果派生类拥有自己的虚函数，此时派生类对象就会产生自己本身的虚函数指针 <code>{vfptr}</code>，并且该虚函数指针位于派生类对象存储空间的最开始位置。</li>
<li>虚函数指针 <code>{vfptr}</code> 放在了虚基指针 <code>{vbptr}</code> 的前面，为了加快虚函数的查找速度。</li>
</ul>
<hr />
<p>结果：</p>
<ul>
<li>虚函数表指明了函数版本，调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h3 id="%E5%A4%9A%E7%BB%A7%E6%89%BF">多继承</h3>
<h4 id="1.%E7%AE%80%E5%8D%95%E5%A4%9A%E7%BB%A7%E6%89%BF">1.简单多继承</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f1() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }

    virtual void f2() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int m_a;
};

class B {
public:
    virtual void f1() {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }

    virtual void f2() {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
private:
    int m_b;
};

class C : virtual public A, virtual public B {
public:

    virtual void myVirtual() {}

    virtual void f1() override {
    	std::cout &lt;&lt; &quot;C\n&quot;;
    }

    virtual void f2() override {
    	std::cout &lt;&lt; &quot;C\n&quot;;
    }
private:
    int m_c;
};
</code></pre>
<p>此时基类 A 和 B 的内存布局为：</p>

<pre class="language-none"><code class="language-none">class A	size(16):
    +---
 0	| {vfptr}
 8	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
A::$vftable@:
    | &amp;A_meta
    |  0
 0	| &amp;A::f1
 1	| &amp;A::f2

class B	size(16):
    +---
 0	| {vfptr}
 8	| m_b
    | &lt;alignment member&gt; (size=4)
    +---
B::$vftable@:
    | &amp;B_meta
    |  0
 0	| &amp;B::f1
 1	| &amp;B::f2
</code></pre>
<p>子类 C 的内存布局为：</p>

<pre class="language-none"><code class="language-none">class C	size(56):
    +---
 0	| {vfptr}		虚函数指针
 8	| {vbptr}		虚基指针
16	| m_c
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
24	| {vfptr}		虚基类虚函数指针
32	| m_a			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base B)
40	| {vfptr}		虚基类虚函数指针
48	| m_b			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
C::$vftable@C@:		类 C 的虚函数表
    | &amp;C_meta
    |  0
 0	| &amp;C::myVirtual
C::$vbtable@:
 0	| -8
 1	| 16 (Cd(C+8)A)		表示类 C 的虚基类 A 位于偏移 16 + 8 = 24 处
 2	| 32 (Cd(C+8)B)		表示类 C 的虚基类 A 位于偏移 32 + 8 = 40 处
C::$vftable@A@:		类 A 的虚函数表
    | -24
 0	| &amp;C::f1
 1	| &amp;C::f2
C::$vftable@B@:
    | -40
 0	| &amp;thunk: this-=16; goto C::f1
 1	| &amp;thunk: this-=16; goto C::f2
C::myVirtual this adjustor: 0
C::f1 this adjustor: 24
C::f2 this adjustor: 24
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      24       8       4 		0
               B      40       8       8 		0
</code></pre>
<ul>
<li>数据区域照常继承。</li>
<li>虚函数表区域中存在三个虚函数表， <code>vftable@C@</code>、 <code>vftable@A@</code>、 <code>vftable@B@</code>；存在一个虚基表 <code>$vbtable@</code>。</li>
<li>派生类会覆盖基类的虚函数，只有第一个虚函数表（此处为 <code>vftable@A@</code> ）中存放的是真实的被覆盖的函数的地址；其它的虚函数表中（如 <code>vftable@B@</code> ）存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令。</li>
</ul>
<h4 id="2.%E6%A3%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%EF%BC%88%E9%92%BB%E7%9F%B3%E7%BB%A7%E6%89%BF%EF%BC%89">2.棱形继承（钻石继承）</h4>
<p>情况如下：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }

private:
    int m_a;
};

class B : virtual public A {
public:
    virtual void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
private:
    int m_b;
};

class C : virtual public A {
public:

    virtual void f() override {
    	std::cout &lt;&lt; &quot;C\n&quot;;
    }

private:
    int m_c;
};

class D : public B, public C {
public:

    virtual void myVirtual() {}

    virtual void f() override {
    	std::cout &lt;&lt; &quot;D\n&quot;;
    }

private:
    int m_d;
};
</code></pre>
<p>此时 A 类的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class A	size(16):
    +---
 0	| {vfptr}
 8	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
A::$vftable@:
    | &amp;A_meta
    |  0
 0	| &amp;A::f
</code></pre>
<p>B 类和 C 类内存布局如下：</p>

<pre class="language-none"><code class="language-none">class B	size(32):
    +---
 0	| {vbptr}
 8	| m_b
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
16	| {vfptr}
24	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
B::$vbtable@:
 0	| 0
 1	| 16 (Bd(B+0)A)
B::$vftable@:
    | -16
 0	| &amp;B::f
B::f this adjustor: 16
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      16       0       4 		0

class C	size(32):
    +---
 0	| {vbptr}
 8	| m_c
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
16	| {vfptr}
24	| m_a
    | &lt;alignment member&gt; (size=4)
    +---
C::$vbtable@:
 0	| 0
 1	| 16 (Cd(C+0)A)
C::$vftable@:
    | -16
 0	| &amp;C::f
C::f this adjustor: 16
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      16       0       4 		0
</code></pre>
<p>子类 D 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class D	size(64):
    +---
 0	| {vfptr}		虚函数指针
 8	| +--- (base class B)
 8	| | {vbptr}		基类虚基指针
16	| | m_b			基类数据成员
    | | &lt;alignment member&gt; (size=4)
    | +---
24	| +--- (base class C)
24	| | {vbptr}		基类虚基指针
32	| | m_c			基类数据成员
    | | &lt;alignment member&gt; (size=4)
    | +---
40	| m_d			子类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
48	| {vfptr}		虚基类虚函数指针
56	| m_a			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
D::$vftable@D@:		类 D 的虚函数表
    | &amp;D_meta
    |  0
 0	| &amp;D::myVirtual
D::$vbtable@B@:
 0	| 0
 1	| 40 (Dd(B+0)A)		表示类 B 的虚基类 A 位于偏移 40 + 0 = 24 处
D::$vbtable@C@:
 0	| 0
 1	| 24 (Dd(C+0)A)		表示类 C 的虚基类 A 位于偏移 24 + 0 = 24 处
D::$vftable@B@:		类 B 的虚函数表（因为类 B 和类 C 都有一样的函数，虚继承时只保留类 B 的虚函数表）
    | -48
 0	| &amp;D::f
D::myVirtual this adjustor: 0
D::f this adjustor: 48
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      48       8       4 		0
</code></pre>
<p>再来一个棱形继承：</p>

<pre class="language-cpp"><code class="language-cpp">class A {
public:
    virtual void f() {
    	std::cout &lt;&lt; &quot;A\n&quot;;
    }
private:
    int val;
};

class B : virtual public A {
public:
    virtual void f() override {
    	std::cout &lt;&lt; &quot;B\n&quot;;
    }
    virtual void g() {}
private:
    int m_b;
};

class C : virtual public A {
public:
    virtual void f() override {
    	std::cout &lt;&lt; &quot;C\n&quot;;
    }
    virtual void h() {}
private:
    int m_c;
};

class D : public B, public C {
public:
    virtual void myVirtual() {}
    virtual void f() override {}
    void g() override {}
    void h() override {}
private:
    int m_d;
};
</code></pre>
<p>针对类 D 的内存布局如下：</p>

<pre class="language-none"><code class="language-none">class D	size(72):
    +---
 0	| +--- (base class B)
 0	| | {vfptr}		基类虚函数指针
 8	| | {vbptr}		基类虚基指针
16	| | m_b			基类数据成员
    | | &lt;alignment member&gt; (size=4)
    | +---
24	| +--- (base class C)
24	| | {vfptr}		基类虚函数指针
32	| | {vbptr}		基类虚基指针
40	| | m_c			基类数据成员
    | | &lt;alignment member&gt; (size=4)
    | +---
48	| m_d			子类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
    +--- (virtual base A)
56	| {vfptr}		虚基类虚函数指针
64	| val			虚基类数据成员
    | &lt;alignment member&gt; (size=4)
    +---
D::$vftable@B@:		类 B 的虚函数表
    | &amp;D_meta
    |  0
 0	| &amp;D::g
 1	| &amp;D::myVirtual
D::$vftable@C@:		类 C 的虚函数表
    | -24
 0	| &amp;D::h
D::$vbtable@B@:
 0	| -8
 1	| 48 (Dd(B+8)A)		表示类 B 的虚基类 A 位于偏移 48 + 8 = 56 处
D::$vbtable@C@:
 0	| -8
 1	| 24 (Dd(C+8)A)		表示类 C 的虚基类 A 位于偏移 24 + 8 = 32 处
D::$vftable@A@:		类 A 的虚函数表
    | -56
 0	| &amp;D::f
D::myVirtual this adjustor: 0
D::f this adjustor: 56
D::g this adjustor: 0
D::h this adjustor: 24
vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
               A      56       8       4 		0
</code></pre>
<p>如果不使用虚继承，出现的问题是：</p>

<pre class="language-none"><code class="language-none">class D	size(56):
    +---
 0	| +--- (base class B)
 0	| | +--- (base class A)
 0	| | | {vfptr}
 8	| | | val
    | | | &lt;alignment member&gt; (size=4)
    | | +---
16	| | m_b
    | | &lt;alignment member&gt; (size=4)
    | +---
24	| +--- (base class C)
24	| | +--- (base class A)
24	| | | {vfptr}
32	| | | val		存在两次 val
    | | | &lt;alignment member&gt; (size=4)
    | | +---
40	| | m_c
    | | &lt;alignment member&gt; (size=4)
    | +---
48	| m_d
    | &lt;alignment member&gt; (size=4)
    +---
</code></pre>

                        
                    </div>
                </div>
                <div id="previous_next">
                    <div id="previous">
                        
                    </div>
                    <div id="next">
                        
                    </div>
                </div>
                <div id="comments-container"></div>
            </div>
            <div id="toc_wrapper">
                <div id="toc">
                    <div id="toc_content">
                            
                    </div>
                </div>
            </div>
        </div>
    </div>
    <a id="to_top" href="#"></a>
    <div id="doc_footer">
        <div id="footer">
            <div id="footer_top">
                <ul>
<li><a></a><ul><li><a target="_blank" href="/#"></a></li>
</ul>
</li>
</ul>

            </div>
            <div id="footer_bottom">
                <ul>
<li><a target="_blank" href="https://github.com/teedoc/teedoc">Generated by teedoc | Fingsinz's Space | ©2023-2025</a></li>
</ul>

            </div>
        </div>
    </div>
    
        <script src="/teedoc-plugin-markdown-parser/mermaid.min.js"></script>
    
        <script>mermaid.initialize({startOnLoad:true});</script>
    
        <script src="/static/js/theme_default/tocbot.min.js"></script>
    
        <script src="/static/js/theme_default/main.js"></script>
    
        <script src="/static/js/theme_default/viewer.min.js"></script>
    
        <script src="/static/css/theme_default/prism.min.js"></script>
    
        <script src="/static/js/search/search_main.js"></script>
    
        <script src="/static/js/custom.js"></script>
    
        <script type="text/javascript" src="/static/js/live.js"></script>
    
</body>

</html>