
<!DOCTYPE html><html lang="zh-CN">

<head>
  <meta charset="utf-8">
  <meta name="hexo-theme" content="https://github.com/xaoxuu/hexo-theme-stellar/tree/1.33.0" theme-name="Stellar" theme-version="1.33.0">
  
  
  <meta name="generator" content="Hexo 7.3.0">
  <meta http-equiv='x-dns-prefetch-control' content='on' />
  
  <meta name="renderer" content="webkit">
  <meta name="force-rendering" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=Edge,chrome=1">
  <meta name="HandheldFriendly" content="True" >
  <meta name="mobile-web-app-capable" content="yes">
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="theme-color" media="(prefers-color-scheme: dark)" content="#000">
  <meta name="theme-color" content="#f9fafb">
  <title>å…³äºC++ç»§æ‰¿ä¸­çš„virtualä»¥åŠè™šæŒ‡é’ˆã€è™šè¡¨ - Fingsinz</title>

  
  <meta name="description" content="å…³é”®è¯ï¼šC++">
  
  <meta name="keywords" content="CPP">

  <!-- feed -->
  

  <link rel="stylesheet" href="/css/main.css?v=1.33.0">


  

  


<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span> <span class="string">&lt;iostream&gt;</span></span></span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;base\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived</span> : <span class="keyword">public</span> Base &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;derived\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">	Base b;</span><br><span class="line">	Derived d;</span><br><span class="line"></span><br><span class="line">	<span class="comment">// é€šè¿‡å¼•ç”¨è°ƒç”¨è™šå‡½æ•°</span></span><br><span class="line">	Base &amp;br = b;</span><br><span class="line">	Base &amp;dr = d;</span><br><span class="line">	br.<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dr.<span class="built_in">f</span>(); <span class="comment">// derived</span></span><br><span class="line"></span><br><span class="line">	<span class="comment">// é€šè¿‡æŒ‡é’ˆè°ƒç”¨è™šå‡½æ•°</span></span><br><span class="line">	Base *bp = &amp;b;</span><br><span class="line">	Base *dp = &amp;d;</span><br><span class="line">	bp-&gt;<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dp-&gt;<span class="built_in">f</span>(); <span class="comment">// derived</span></span><br><span class="line"></span><br><span class="line">	<span class="comment">// éè™šå‡½æ•°è°ƒç”¨</span></span><br><span class="line">	br.Base::<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dr.Base::<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	<span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>æ³¨æ„è¦æŠŠçˆ¶ç±»çš„ææ„å‡½æ•°å£°æ˜ä¸ºè™šå‡½æ•°ï¼Œè¿™æ ·å­ç±»ææ„æ—¶ä¼šæ­£ç¡®è°ƒç”¨å­ç±»çš„ææ„å‡½æ•°ï¼Œé¿å…äº†å†…å­˜æ³„æ¼çš„é£é™©ã€‚</p>
<h4 id="è™šå‡½æ•°æŒ‡é’ˆå’Œè™šå‡½æ•°è¡¨">è™šå‡½æ•°æŒ‡é’ˆå’Œè™šå‡½æ•°è¡¨</h4>
<p>è™šå‡½æ•°æŒ‡é’ˆï¼ˆvfptrï¼‰æŒ‡å‘ä¸€ä¸ªè™šå‡½æ•°è¡¨ï¼ˆvftableï¼‰ï¼Œè™šå‡½æ•°è¡¨è®°å½•äº†è™šå‡½æ•°çš„åœ°å€ã€‚</p>
<p>è™šè¡¨æ˜¯å±äºç±»çš„ï¼Œä¸€ä¸ªç±»åªéœ€è¦ä¸€ä¸ªè™šè¡¨å³å¯ï¼ŒåŒä¸€ä¸ªç±»çš„æ‰€æœ‰å¯¹è±¡éƒ½ä½¿ç”¨åŒä¸€ä¸ªè™šè¡¨ã€‚</p>
<h3 id="è™šç»§æ‰¿">è™šç»§æ‰¿</h3>
<p>è™šç»§æ‰¿è§£å†³çš„æ˜¯ C++ å¤šé‡ç»§æ‰¿å¸¦æ¥çš„é—®é¢˜ã€‚</p>
<ul>
<li>ä»ä¸åŒé€”å¾„ç»§æ‰¿æ¥çš„åŒä¸€åŸºç±»ï¼Œä¼šåœ¨å­ç±»ä¸­å­˜åœ¨å¤šä»½æ‹·è´ï¼Œæ—¢æµªè´¹å­˜å‚¨ç©ºé—´ï¼Œä¹Ÿå­˜åœ¨äºŒä¹‰æ€§ã€‚</li>
</ul>
<p>è™šç»§æ‰¿åº•å±‚å®ç°ä¸ç¼–è¯‘å™¨ç›¸å…³ï¼Œä¸€èˆ¬é€šè¿‡è™šåŸºæŒ‡é’ˆå’Œè™šåŸºè¡¨å®ç°ã€‚</p>
<ul>
<li>æ¯ä¸ªè™šç»§æ‰¿çš„å­ç±»éƒ½æœ‰ä¸€ä¸ªè™šåŸºç±»æŒ‡é’ˆï¼ˆå ç”¨ä¸€ä¸ªæŒ‡é’ˆçš„å­˜å‚¨ç©ºé—´ï¼‰å’Œè™šåŸºç±»è¡¨ï¼ˆä¸å ç”¨ç±»å¯¹è±¡çš„å­˜å‚¨ç©ºé—´ï¼‰ã€‚</li>
</ul>
<h4 id="è™šåŸºæŒ‡é’ˆå’Œè™šåŸºè¡¨">è™šåŸºæŒ‡é’ˆå’Œè™šåŸºè¡¨</h4>
<p>è™šåŸºæŒ‡é’ˆï¼ˆvbptrï¼‰æŒ‡å‘ä¸€ä¸ªè™šåŸºè¡¨ï¼ˆvbtableï¼‰ï¼Œè™šåŸºè¡¨è®°å½•äº†è™šåŸºç±»ä¸æœ¬ç±»çš„åç§»åœ°å€ï¼Œé€šè¿‡åç§»åœ°å€æ‰¾åˆ°è™šåŸºç±»æˆå‘˜ï¼Œè€Œä¸ç”¨æŒæœ‰æ‹·è´æµªè´¹ç©ºé—´ã€‚</p>
<p>ä¸è™šå‡½æ•°æŒ‡é’ˆå’Œè™šå‡½æ•°è¡¨ç›¸æ¯”ï¼š</p>
<ul>
<li>è™šåŸºç±»ä¾æ—§å­˜åœ¨ç»§æ‰¿ç±»ä¸­ï¼Œå ç”¨å­˜å‚¨ç©ºé—´ï¼›è™šå‡½æ•°ä¸å ç”¨å­˜å‚¨ç©ºé—´ã€‚</li>
<li>è™šåŸºç±»è¡¨å­˜å‚¨çš„æ˜¯è™šåŸºç±»ç›¸å¯¹ç›´æ¥ç»§æ‰¿ç±»çš„åç§»ï¼›è€Œè™šå‡½æ•°è¡¨å­˜å‚¨çš„æ˜¯è™šå‡½æ•°åœ°å€ã€‚</li>
</ul>
<h2 id="ä»å†…å­˜å¸ƒå±€çœ‹">ä»å†…å­˜å¸ƒå±€çœ‹</h2>
<h3 id="æ— ç»§æ‰¿">æ— ç»§æ‰¿</h3>
<p>å•çº¯ä¸€ä¸ªç±»æ—¶ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>VS æ‰€è¾“å‡ºå†…å­˜å¸ƒå±€ä¸ºï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></table></figure>
<p>å†…å­˜å¤§å°ä¸ºä¸€ä¸ª <code>int</code> å˜é‡çš„å¤§å°ã€‚</p>
<h3 id="å•ç»§æ‰¿">å•ç»§æ‰¿</h3>
<h4 id="1-éè™šç»§æ‰¿æ— è™šå‡½æ•°">1.éè™šç»§æ‰¿æ— è™šå‡½æ•°</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>åŸºç±» A çš„å†…å­˜å¸ƒå±€ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œä¸å­˜åœ¨ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆï¼Œåªå­˜åœ¨ <code>m_a</code> å˜é‡ï¼ˆ4 å­—èŠ‚ï¼‰ã€‚æ‰€ä»¥å å†…å­˜ 4 å­—èŠ‚ã€‚</li>
</ul>
<p>æ´¾ç”Ÿç±» B çš„å†…å­˜å¸ƒå±€ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class B	size(8):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class A)</span><br><span class="line"> 0	| | m_a		åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">	| +---</span><br><span class="line"> 4	| m_b		å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">	+---</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œä¸å­˜åœ¨ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆï¼Œåªå­˜åœ¨ <code>m_b</code> å˜é‡ï¼ˆ4 å­—èŠ‚ï¼‰å’Œç»§æ‰¿å¾—åˆ°çš„ <code>m_a</code> å˜é‡ï¼Œæ‰€ä»¥å å†…å­˜ 8 å­—èŠ‚ã€‚</li>
</ul>
<p>ç»“æœï¼š</p>
<ul>
<li>ç”±äºä¸å­˜åœ¨è™šå‡½æ•°è¡¨ï¼Œæ•…å¹¶ä¸ä¼šè°ƒç”¨å®šä¹‰äºæ´¾ç”Ÿç±»ä¸­ï¼ˆé‡å†™ï¼‰çš„å‡½æ•°ç‰ˆæœ¬ã€‚</li>
</ul>
<h4 id="2-éè™šç»§æ‰¿æœ‰è™šå‡½æ•°">2.éè™šç»§æ‰¿æœ‰è™šå‡½æ•°</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>åŸºç±» A çš„å†…å­˜å¸ƒå±€ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œå­˜åœ¨ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆï¼ˆ8 å­—èŠ‚ï¼Œ64ä½ç³»ç»Ÿï¼‰ã€ <code>m_a</code> å˜é‡ï¼ˆ4 å­—èŠ‚ï¼‰ã€‚åŒæ—¶è¿›è¡Œå†…å­˜å¯¹é½ï¼ˆ+4 å­—èŠ‚ï¼‰ï¼Œæ‰€ä»¥å å†…å­˜ 16 å­—èŠ‚ã€‚</li>
<li>åœ¨è™šå‡½æ•°è¡¨ä¸­ï¼Œå­˜åœ¨è™šå‡½æ•° <code>f</code>ã€‚</li>
</ul>
<p>å­ç±» B çš„å†…å­˜å¸ƒå±€ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">class B	size(24):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class A)</span><br><span class="line"> 0	| | &#123;vfptr&#125;		è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line"> 8	| | m_a			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">16	| m_b			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@:		è™šå‡½æ•°è¡¨</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œå­˜åœ¨ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆï¼ˆ8 å­—èŠ‚ï¼Œ64ä½ç³»ç»Ÿï¼‰ã€ <code>m_a</code> å˜é‡ï¼ˆ4 å­—èŠ‚ï¼‰ï¼ŒåŒæ ·è¿›è¡Œå†…å­˜å¯¹é½ï¼ˆ+4 å­—èŠ‚ï¼‰ï¼Œå†åŠ ä¸Šå­ç±»è‡ªèº«çš„æˆå‘˜å˜é‡ <code>m_b</code> ï¼ˆ4 å­—èŠ‚ï¼‰ï¼Œå†åŠ ä»¥å†…å­˜å¯¹é½ï¼ˆ+4 å­—èŠ‚ï¼‰ï¼Œæ‰€ä»¥å å†…å­˜ 24 å­—èŠ‚ã€‚</li>
<li>åœ¨è™šå‡½æ•°è¡¨ä¸­ï¼Œå­˜åœ¨è™šå‡½æ•° <code>f</code>ï¼ŒæŒ‡æ˜äº†å‡½æ•°ç‰ˆæœ¬ã€‚</li>
</ul>
<p>ç»“æœï¼š</p>
<ul>
<li>è™šå‡½æ•°è¡¨æŒ‡æ˜äº†å‡½æ•°ç‰ˆæœ¬ï¼Œè°ƒç”¨å®šä¹‰äºæ´¾ç”Ÿç±»ä¸­ï¼ˆé‡å†™ï¼‰çš„å‡½æ•°ç‰ˆæœ¬ã€‚</li>
</ul>
<h4 id="3-è™šç»§æ‰¿æ— è™šå‡½æ•°">3.è™šç»§æ‰¿æ— è™šå‡½æ•°</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>çˆ¶ç±» A çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></table></figure>
<ul>
<li>åªæœ‰æ•°æ®åŒºåŸŸçš„å˜é‡ã€‚</li>
</ul>
<p>å­ç±» B çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line">class B	size(24):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;		è™šåŸºæŒ‡é’ˆ</span><br><span class="line"> 8	| m_b			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| m_a			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)		è¡¨ç¤ºç±» B çš„è™šåŸºç±» A ä½äºåç§» 16 + 0 = 16 å¤„</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œå­˜åœ¨è™šåŸºæŒ‡é’ˆ <code>&#123;vbptr&#125;</code>ï¼Œä¸”è™šåŸºç±»ä½äºå­ç±»å­˜å‚¨ç©ºé—´çš„æœ«å°¾ã€‚</li>
<li>å­˜åœ¨è™šåŸºè¡¨ <code>&#123;vbtable&#125;</code>ã€‚</li>
</ul>
<p>ç»“æœï¼š</p>
<ul>
<li>ç”±äºä¸å­˜åœ¨è™šå‡½æ•°è¡¨ï¼Œä¸ä¼šè°ƒç”¨å®šä¹‰äºæ´¾ç”Ÿç±»ä¸­ï¼ˆé‡å†™ï¼‰çš„å‡½æ•°ç‰ˆæœ¬ã€‚</li>
</ul>
<h4 id="4-è™šç»§æ‰¿æœ‰è™šå‡½æ•°">4.è™šç»§æ‰¿æœ‰è™šå‡½æ•°</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>çˆ¶ç±» A çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œå­˜åœ¨ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆï¼ˆ8 å­—èŠ‚ï¼Œ64ä½ç³»ç»Ÿï¼‰ã€ <code>m_a</code> å˜é‡ï¼ˆ4 å­—èŠ‚ï¼‰ã€‚åŒæ—¶è¿›è¡Œå†…å­˜å¯¹é½ï¼ˆ+4 å­—èŠ‚ï¼‰ï¼Œæ‰€ä»¥å å†…å­˜ 16 å­—èŠ‚ã€‚</li>
<li>åœ¨è™šå‡½æ•°è¡¨ä¸­ï¼Œå­˜åœ¨è™šå‡½æ•° <code>f</code>ã€‚</li>
</ul>
<p>å­ç±» B çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">class B	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;		è™šåŸºæŒ‡é’ˆ</span><br><span class="line"> 8	| m_b			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">24	| m_a			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)		è¡¨ç¤ºç±» B çš„è™šåŸºç±» A ä½äºåç§» 16 + 0 = 16 å¤„</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></table></figure>
<ul>
<li>åœ¨æ•°æ®åŒºåŸŸï¼Œå­˜åœ¨ <code>&#123;vbptr&#125;</code> è™šåŸºæŒ‡é’ˆ å’Œ <code>&#123;vfptr&#125;</code> è™šå‡½æ•°æŒ‡é’ˆã€‚</li>
<li>åœ¨è™šå‡½æ•°è¡¨ä¸­ï¼Œå­˜åœ¨è™šå‡½æ•° <code>f</code>ï¼ŒæŒ‡æ˜äº†å‡½æ•°ç‰ˆæœ¬ã€‚</li>
<li>å¦‚æœæ´¾ç”Ÿç±»æ²¡æœ‰ç‹¬ç«‹çš„è™šå‡½æ•°ï¼Œæ­¤æ—¶æ´¾ç”Ÿç±»å¯¹è±¡ä¸ä¼šäº§ç”Ÿè™šå‡½æ•°æŒ‡é’ˆã€‚</li>
</ul>
<hr>
<p>è‹¥æ´¾ç”Ÿç±»ä¸­æœ‰ç‹¬ç«‹çš„è™šå‡½æ•°ï¼Œä¼šäº§ç”Ÿè™šå‡½æ•°æŒ‡é’ˆï¼š</p>
<p>å¦‚ä¸‹æƒ…å½¢ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>&#123;	<span class="comment">// æ´¾ç”Ÿç±»ä¸­ç‹¬ç«‹çš„è™šå‡½æ•°</span></span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;tmp\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>å¯¼è‡´å†…å­˜å¸ƒå±€ä¸ºï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line">class B	size(40):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;		è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line"> 8	| &#123;vbptr&#125;		è™šåŸºæŒ‡é’ˆ</span><br><span class="line">16	| m_b			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">24	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">32	| m_a			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@B@:		ç±» B çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f1</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 16 (Bd(B+8)A)		è¡¨ç¤ºç±» B çš„è™šåŸºç±» A ä½äºåç§» 16 + 8 = 24 å¤„</span><br><span class="line">B::$vftable@A@:		ç±» A çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 24</span><br><span class="line">B::f1 this adjustor: 0</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      24       8       4 		0</span><br></pre></td></tr></table></figure>
<ul>
<li>å¦‚æœæ´¾ç”Ÿç±»æ‹¥æœ‰è‡ªå·±çš„è™šå‡½æ•°ï¼Œæ­¤æ—¶æ´¾ç”Ÿç±»å¯¹è±¡å°±ä¼šäº§ç”Ÿè‡ªå·±æœ¬èº«çš„è™šå‡½æ•°æŒ‡é’ˆ <code>&#123;vfptr&#125;</code>ï¼Œå¹¶ä¸”è¯¥è™šå‡½æ•°æŒ‡é’ˆä½äºæ´¾ç”Ÿç±»å¯¹è±¡å­˜å‚¨ç©ºé—´çš„æœ€å¼€å§‹ä½ç½®ã€‚</li>
<li>è™šå‡½æ•°æŒ‡é’ˆ <code>&#123;vfptr&#125;</code> æ”¾åœ¨äº†è™šåŸºæŒ‡é’ˆ <code>&#123;vbptr&#125;</code> çš„å‰é¢ï¼Œä¸ºäº†åŠ å¿«è™šå‡½æ•°çš„æŸ¥æ‰¾é€Ÿåº¦ã€‚</li>
</ul>
<hr>
<p>ç»“æœï¼š</p>
<ul>
<li>è™šå‡½æ•°è¡¨æŒ‡æ˜äº†å‡½æ•°ç‰ˆæœ¬ï¼Œè°ƒç”¨å®šä¹‰äºæ´¾ç”Ÿç±»ä¸­ï¼ˆé‡å†™ï¼‰çš„å‡½æ•°ç‰ˆæœ¬ã€‚</li>
</ul>
<h3 id="å¤šç»§æ‰¿">å¤šç»§æ‰¿</h3>
<h4 id="1-ç®€å•å¤šç»§æ‰¿">1.ç®€å•å¤šç»§æ‰¿</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A, <span class="keyword">virtual</span> <span class="keyword">public</span> B &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;C\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;C\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>æ­¤æ—¶åŸºç±» A å’Œ B çš„å†…å­˜å¸ƒå±€ä¸ºï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f1</span><br><span class="line"> 1	| &amp;A::f2</span><br><span class="line"></span><br><span class="line">class B	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 8	| m_b</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f1</span><br><span class="line"> 1	| &amp;B::f2</span><br></pre></td></tr></table></figure>
<p>å­ç±» C çš„å†…å­˜å¸ƒå±€ä¸ºï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br></pre></td><td class="code"><pre><span class="line">class C	size(56):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;		è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line"> 8	| &#123;vbptr&#125;		è™šåŸºæŒ‡é’ˆ</span><br><span class="line">16	| m_c</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">24	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">32	| m_a			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base B)</span><br><span class="line">40	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">48	| m_b			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">C::$vftable@C@:		ç±» C çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| &amp;C_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;C::myVirtual</span><br><span class="line">C::$vbtable@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 16 (Cd(C+8)A)		è¡¨ç¤ºç±» C çš„è™šåŸºç±» A ä½äºåç§» 16 + 8 = 24 å¤„</span><br><span class="line"> 2	| 32 (Cd(C+8)B)		è¡¨ç¤ºç±» C çš„è™šåŸºç±» A ä½äºåç§» 32 + 8 = 40 å¤„</span><br><span class="line">C::$vftable@A@:		ç±» A çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;C::f1</span><br><span class="line"> 1	| &amp;C::f2</span><br><span class="line">C::$vftable@B@:</span><br><span class="line">	| -40</span><br><span class="line"> 0	| &amp;thunk: this-=16; goto C::f1</span><br><span class="line"> 1	| &amp;thunk: this-=16; goto C::f2</span><br><span class="line">C::myVirtual this adjustor: 0</span><br><span class="line">C::f1 this adjustor: 24</span><br><span class="line">C::f2 this adjustor: 24</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      24       8       4 		0</span><br><span class="line">               B      40       8       8 		0</span><br></pre></td></tr></table></figure>
<ul>
<li>æ•°æ®åŒºåŸŸç…§å¸¸ç»§æ‰¿ã€‚</li>
<li>è™šå‡½æ•°è¡¨åŒºåŸŸä¸­å­˜åœ¨ä¸‰ä¸ªè™šå‡½æ•°è¡¨ï¼Œ <code>vftable@C@</code>ã€ <code>vftable@A@</code>ã€ <code>vftable@B@</code>ï¼›å­˜åœ¨ä¸€ä¸ªè™šåŸºè¡¨ <code>$vbtable@</code>ã€‚</li>
<li>æ´¾ç”Ÿç±»ä¼šè¦†ç›–åŸºç±»çš„è™šå‡½æ•°ï¼Œåªæœ‰ç¬¬ä¸€ä¸ªè™šå‡½æ•°è¡¨ï¼ˆæ­¤å¤„ä¸º <code>vftable@A@</code> ï¼‰ä¸­å­˜æ”¾çš„æ˜¯çœŸå®çš„è¢«è¦†ç›–çš„å‡½æ•°çš„åœ°å€ï¼›å…¶å®ƒçš„è™šå‡½æ•°è¡¨ä¸­ï¼ˆå¦‚ <code>vftable@B@</code> ï¼‰å­˜æ”¾çš„å¹¶ä¸æ˜¯çœŸå®çš„å¯¹åº”çš„è™šå‡½æ•°çš„åœ°å€ï¼Œè€Œåªæ˜¯ä¸€æ¡è·³è½¬æŒ‡ä»¤ã€‚</li>
</ul>
<h4 id="2-æ£±å½¢ç»§æ‰¿-é’»çŸ³ç»§æ‰¿">2.æ£±å½¢ç»§æ‰¿ï¼ˆé’»çŸ³ç»§æ‰¿ï¼‰</h4>
<p>æƒ…å†µå¦‚ä¸‹ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;C\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">D</span> : <span class="keyword">public</span> B, <span class="keyword">public</span> C &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;D\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_d;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>æ­¤æ—¶ A ç±»çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></table></figure>
<p>B ç±»å’Œ C ç±»å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br></pre></td><td class="code"><pre><span class="line">class B	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line"> 8	| m_b</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| &#123;vfptr&#125;</span><br><span class="line">24	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br><span class="line"></span><br><span class="line">class C	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line"> 8	| m_c</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| &#123;vfptr&#125;</span><br><span class="line">24	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">C::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Cd(C+0)A)</span><br><span class="line">C::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;C::f</span><br><span class="line">C::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></table></figure>
<p>å­ç±» D çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line">class D	size(64):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;		è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line"> 8	| +--- (base class B)</span><br><span class="line"> 8	| | &#123;vbptr&#125;		åŸºç±»è™šåŸºæŒ‡é’ˆ</span><br><span class="line">16	| | m_b			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">24	| +--- (base class C)</span><br><span class="line">24	| | &#123;vbptr&#125;		åŸºç±»è™šåŸºæŒ‡é’ˆ</span><br><span class="line">32	| | m_c			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">40	| m_d			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line"> 	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">48	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">56	| m_a			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">D::$vftable@D@:		ç±» D çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| &amp;D_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;D::myVirtual</span><br><span class="line">D::$vbtable@B@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 40 (Dd(B+0)A)		è¡¨ç¤ºç±» B çš„è™šåŸºç±» A ä½äºåç§» 40 + 0 = 24 å¤„</span><br><span class="line">D::$vbtable@C@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 24 (Dd(C+0)A)		è¡¨ç¤ºç±» C çš„è™šåŸºç±» A ä½äºåç§» 24 + 0 = 24 å¤„</span><br><span class="line">D::$vftable@B@:		ç±» B çš„è™šå‡½æ•°è¡¨ï¼ˆå› ä¸ºç±» B å’Œç±» C éƒ½æœ‰ä¸€æ ·çš„å‡½æ•°ï¼Œè™šç»§æ‰¿æ—¶åªä¿ç•™ç±» B çš„è™šå‡½æ•°è¡¨ï¼‰</span><br><span class="line">	| -48</span><br><span class="line"> 0	| &amp;D::f</span><br><span class="line">D::myVirtual this adjustor: 0</span><br><span class="line">D::f this adjustor: 48</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      48       8       4 		0</span><br></pre></td></tr></table></figure>
<p>å†æ¥ä¸€ä¸ªæ£±å½¢ç»§æ‰¿ï¼š</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;A\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> val;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;B\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">g</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">		std::cout &lt;&lt; <span class="string">&quot;C\n&quot;</span>;</span><br><span class="line">	&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">h</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">D</span> : <span class="keyword">public</span> B, <span class="keyword">public</span> C &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">g</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">h</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_d;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>é’ˆå¯¹ç±» D çš„å†…å­˜å¸ƒå±€å¦‚ä¸‹ï¼š</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br></pre></td><td class="code"><pre><span class="line">class D	size(72):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class B)</span><br><span class="line"> 0	| | &#123;vfptr&#125;		åŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line"> 8	| | &#123;vbptr&#125;		åŸºç±»è™šåŸºæŒ‡é’ˆ</span><br><span class="line">16	| | m_b			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">24	| +--- (base class C)</span><br><span class="line">24	| | &#123;vfptr&#125;		åŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">32	| | &#123;vbptr&#125;		åŸºç±»è™šåŸºæŒ‡é’ˆ</span><br><span class="line">40	| | m_c			åŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">48	| m_d			å­ç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">56	| &#123;vfptr&#125;		è™šåŸºç±»è™šå‡½æ•°æŒ‡é’ˆ</span><br><span class="line">64	| val			è™šåŸºç±»æ•°æ®æˆå‘˜</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">D::$vftable@B@:		ç±» B çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| &amp;D_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;D::g</span><br><span class="line"> 1	| &amp;D::myVirtual</span><br><span class="line">D::$vftable@C@:		ç±» C çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;D::h</span><br><span class="line">D::$vbtable@B@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 48 (Dd(B+8)A)		è¡¨ç¤ºç±» B çš„è™šåŸºç±» A ä½äºåç§» 48 + 8 = 56 å¤„</span><br><span class="line">D::$vbtable@C@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 24 (Dd(C+8)A)		è¡¨ç¤ºç±» C çš„è™šåŸºç±» A ä½äºåç§» 24 + 8 = 32 å¤„</span><br><span class="line">D::$vftable@A@:		ç±» A çš„è™šå‡½æ•°è¡¨</span><br><span class="line">	| -56</span><br><span class="line"> 0	| &amp;D::f</span><br><span class="line">D::myVirtual this adjustor: 0</span><br><span class="line">D::f this adjustor: 56</span><br><span class="line">D::g this adjustor: 0</span><br><span class="line">D::h this adjustor: 24</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      56       8       4 		0</span><br></pre></td></tr></table></figure>
<p>å¦‚æœä¸ä½¿ç”¨è™šç»§æ‰¿ï¼Œå‡ºç°çš„é—®é¢˜æ˜¯ï¼š</p>
