<!DOCTYPE html>
<html lang="zh-CN">
    
    <head>
    <meta charset="utf-8">
    <meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no, viewport-fit=cover" name="viewport" />
    <meta name="description" content="关于C++继承中的virtual以及虚指针、虚表" />
    <meta name="hexo-theme-A4" content="v1.9.6" />
    <link rel="alternate icon" type="image/webp" href="/img/favicon.webp">
    <title>Fingsinz&#39;s space | 风信梓</title>

    
        
<link rel="stylesheet" href="/css/highlight/style1.css">

        
<link rel="stylesheet" href="/css/reset.css">

        
<link rel="stylesheet" href="/css/markdown.css">

        
<link rel="stylesheet" href="/css/fonts.css">
 
         <!--注意：首页既不是post也不是page-->
        
        
        
<link rel="stylesheet" href="/css/ui.css">
 
        
<link rel="stylesheet" href="/css/style.css">


        
            <!--返回顶部css-->
            
<link rel="stylesheet" href="/css/returnToTop.css">

            
<link rel="stylesheet" href="/css/unicons.css">

        
        
            <!--目录-->
            
<link rel="stylesheet" href="/css/toc.css">

        
    

    
        
<link rel="stylesheet" href="/css/returnToLastPage.css">

    
    
   
<link rel="stylesheet" href="/css/lightgallery-bundle.min.css">


<meta name="generator" content="Hexo 7.1.1">

<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span> <span class="string">&lt;iostream&gt;</span></span></span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Base</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"base\n"</span>;</span><br><span class="line">	}</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Derived</span> : <span class="keyword">public</span> Base {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"derived\n"</span>;</span><br><span class="line">	}</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>{</span><br><span class="line">	Base b;</span><br><span class="line">	Derived d;</span><br><span class="line"></span><br><span class="line">	<span class="comment">// 通过引用调用虚函数</span></span><br><span class="line">	Base &amp;br = b;</span><br><span class="line">	Base &amp;dr = d;</span><br><span class="line">	br.<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dr.<span class="built_in">f</span>(); <span class="comment">// derived</span></span><br><span class="line"></span><br><span class="line">	<span class="comment">// 通过指针调用虚函数</span></span><br><span class="line">	Base *bp = &amp;b;</span><br><span class="line">	Base *dp = &amp;d;</span><br><span class="line">	bp-&gt;<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dp-&gt;<span class="built_in">f</span>(); <span class="comment">// derived</span></span><br><span class="line"></span><br><span class="line">	<span class="comment">// 非虚函数调用</span></span><br><span class="line">	br.Base::<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	dr.Base::<span class="built_in">f</span>(); <span class="comment">// base</span></span><br><span class="line">	<span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p>注意要把父类的析构函数声明为虚函数，这样子类析构时会正确调用子类的析构函数，避免了内存泄漏的风险。</p>
<h4 id="虚函数指针和虚函数表">虚函数指针和虚函数表</h4>
<p>虚函数指针（vfptr）指向一个虚函数表（vftable），虚函数表记录了虚函数的地址。</p>
<p>虚表是属于类的，一个类只需要一个虚表即可，同一个类的所有对象都使用同一个虚表。</p>
<h3 id="虚继承">虚继承</h3>
<p>虚继承解决的是 C++ 多重继承带来的问题。</p>
<ul>
<li>从不同途径继承来的同一基类，会在子类中存在多份拷贝，既浪费存储空间，也存在二义性。</li>
</ul>
<p>虚继承底层实现与编译器相关，一般通过虚基指针和虚基表实现。</p>
<ul>
<li>每个虚继承的子类都有一个虚基类指针（占用一个指针的存储空间）和虚基类表（不占用类对象的存储空间）。</li>
</ul>
<h4 id="虚基指针和虚基表">虚基指针和虚基表</h4>
<p>虚基指针（vbptr）指向一个虚基表（vbtable），虚基表记录了虚基类与本类的偏移地址，通过偏移地址找到虚基类成员，而不用持有拷贝浪费空间。</p>
<p>与虚函数指针和虚函数表相比：</p>
<ul>
<li>虚基类依旧存在继承类中，占用存储空间；虚函数不占用存储空间。</li>
<li>虚基类表存储的是虚基类相对直接继承类的偏移；而虚函数表存储的是虚函数地址。</li>
</ul>
<h2 id="从内存布局看">从内存布局看</h2>
<h3 id="无继承">无继承</h3>
<p>单纯一个类时：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>VS 所输出内存布局为：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></tbody></table></figure>
<p>内存大小为一个 <code>int</code> 变量的大小。</p>
<h3 id="单继承">单继承</h3>
<h4 id="1-非虚继承无虚函数">1.非虚继承无虚函数</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>基类 A 的内存布局：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，不存在 <code>{vfptr}</code> 虚函数指针，只存在 <code>m_a</code> 变量（4 字节）。所以占内存 4 字节。</li>
</ul>
<p>派生类 B 的内存布局：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class B	size(8):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class A)</span><br><span class="line"> 0	| | m_a		基类数据成员</span><br><span class="line">	| +---</span><br><span class="line"> 4	| m_b		子类数据成员</span><br><span class="line">	+---</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，不存在 <code>{vfptr}</code> 虚函数指针，只存在 <code>m_b</code> 变量（4 字节）和继承得到的 <code>m_a</code> 变量，所以占内存 8 字节。</li>
</ul>
<p>结果：</p>
<ul>
<li>由于不存在虚函数表，故并不会调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="2-非虚继承有虚函数">2.非虚继承有虚函数</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>基类 A 的内存布局：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节）。同时进行内存对齐（+4 字节），所以占内存 16 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>。</li>
</ul>
<p>子类 B 的内存布局：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">class B	size(24):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class A)</span><br><span class="line"> 0	| | {vfptr}		虚函数指针</span><br><span class="line"> 8	| | m_a			基类数据成员</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">16	| m_b			子类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@:		虚函数表</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节），同样进行内存对齐（+4 字节），再加上子类自身的成员变量 <code>m_b</code> （4 字节），再加以内存对齐（+4 字节），所以占内存 24 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>，指明了函数版本。</li>
</ul>
<p>结果：</p>
<ul>
<li>虚函数表指明了函数版本，调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="3-虚继承无虚函数">3.虚继承无虚函数</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>父类 A 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">class A	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| m_a</span><br><span class="line">	+---</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>只有数据区域的变量。</li>
</ul>
<p>子类 B 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line">class B	size(24):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vbptr}		虚基指针</span><br><span class="line"> 8	| m_b			子类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| m_a			基类数据成员</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)		表示类 B 的虚基类 A 位于偏移 16 + 0 = 16 处</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，存在虚基指针 <code>{vbptr}</code>，且虚基类位于子类存储空间的末尾。</li>
<li>存在虚基表 <code>{vbtable}</code>。</li>
</ul>
<p>结果：</p>
<ul>
<li>由于不存在虚函数表，不会调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h4 id="4-虚继承有虚函数">4.虚继承有虚函数</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>父类 A 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，存在 <code>{vfptr}</code> 虚函数指针（8 字节，64位系统）、 <code>m_a</code> 变量（4 字节）。同时进行内存对齐（+4 字节），所以占内存 16 字节。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>。</li>
</ul>
<p>子类 B 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">class B	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vbptr}		虚基指针</span><br><span class="line"> 8	| m_b			子类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| {vfptr}		虚基类虚函数指针</span><br><span class="line">24	| m_a			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)		表示类 B 的虚基类 A 位于偏移 16 + 0 = 16 处</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>在数据区域，存在 <code>{vbptr}</code> 虚基指针 和 <code>{vfptr}</code> 虚函数指针。</li>
<li>在虚函数表中，存在虚函数 <code>f</code>，指明了函数版本。</li>
<li>如果派生类没有独立的虚函数，此时派生类对象不会产生虚函数指针。</li>
</ul>
<hr>
<p>若派生类中有独立的虚函数，会产生虚函数指针：</p>
<p>如下情形：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>{	<span class="comment">// 派生类中独立的虚函数</span></span><br><span class="line">		std::cout &lt;&lt; <span class="string">"tmp\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>导致内存布局为：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line">class B	size(40):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}		虚函数指针</span><br><span class="line"> 8	| {vbptr}		虚基指针</span><br><span class="line">16	| m_b			子类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">24	| {vfptr}		虚基类虚函数指针</span><br><span class="line">32	| m_a			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@B@:		类 B 的虚函数表</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f1</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 16 (Bd(B+8)A)		表示类 B 的虚基类 A 位于偏移 16 + 8 = 24 处</span><br><span class="line">B::$vftable@A@:		类 A 的虚函数表</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 24</span><br><span class="line">B::f1 this adjustor: 0</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      24       8       4 		0</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>如果派生类拥有自己的虚函数，此时派生类对象就会产生自己本身的虚函数指针 <code>{vfptr}</code>，并且该虚函数指针位于派生类对象存储空间的最开始位置。</li>
<li>虚函数指针 <code>{vfptr}</code> 放在了虚基指针 <code>{vbptr}</code> 的前面，为了加快虚函数的查找速度。</li>
</ul>
<hr>
<p>结果：</p>
<ul>
<li>虚函数表指明了函数版本，调用定义于派生类中（重写）的函数版本。</li>
</ul>
<h3 id="多继承">多继承</h3>
<h4 id="1-简单多继承">1.简单多继承</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A, <span class="keyword">virtual</span> <span class="keyword">public</span> B {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>{}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f1</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"C\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f2</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"C\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>此时基类 A 和 B 的内存布局为：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f1</span><br><span class="line"> 1	| &amp;A::f2</span><br><span class="line"></span><br><span class="line">class B	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}</span><br><span class="line"> 8	| m_b</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;B::f1</span><br><span class="line"> 1	| &amp;B::f2</span><br></pre></td></tr></tbody></table></figure>
<p>子类 C 的内存布局为：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br></pre></td><td class="code"><pre><span class="line">class C	size(56):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}		虚函数指针</span><br><span class="line"> 8	| {vbptr}		虚基指针</span><br><span class="line">16	| m_c</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">24	| {vfptr}		虚基类虚函数指针</span><br><span class="line">32	| m_a			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base B)</span><br><span class="line">40	| {vfptr}		虚基类虚函数指针</span><br><span class="line">48	| m_b			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">C::$vftable@C@:		类 C 的虚函数表</span><br><span class="line">	| &amp;C_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;C::myVirtual</span><br><span class="line">C::$vbtable@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 16 (Cd(C+8)A)		表示类 C 的虚基类 A 位于偏移 16 + 8 = 24 处</span><br><span class="line"> 2	| 32 (Cd(C+8)B)		表示类 C 的虚基类 A 位于偏移 32 + 8 = 40 处</span><br><span class="line">C::$vftable@A@:		类 A 的虚函数表</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;C::f1</span><br><span class="line"> 1	| &amp;C::f2</span><br><span class="line">C::$vftable@B@:</span><br><span class="line">	| -40</span><br><span class="line"> 0	| &amp;thunk: this-=16; goto C::f1</span><br><span class="line"> 1	| &amp;thunk: this-=16; goto C::f2</span><br><span class="line">C::myVirtual this adjustor: 0</span><br><span class="line">C::f1 this adjustor: 24</span><br><span class="line">C::f2 this adjustor: 24</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      24       8       4 		0</span><br><span class="line">               B      40       8       8 		0</span><br></pre></td></tr></tbody></table></figure>
<ul>
<li>数据区域照常继承。</li>
<li>虚函数表区域中存在三个虚函数表， <code>vftable@C@</code>、 <code>vftable@A@</code>、 <code>vftable@B@</code>；存在一个虚基表 <code>$vbtable@</code>。</li>
<li>派生类会覆盖基类的虚函数，只有第一个虚函数表（此处为 <code>vftable@A@</code> ）中存放的是真实的被覆盖的函数的地址；其它的虚函数表中（如 <code>vftable@B@</code> ）存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令。</li>
</ul>
<h4 id="2-棱形继承-钻石继承">2.棱形继承（钻石继承）</h4>
<p>情况如下：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_a;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"C\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">D</span> : <span class="keyword">public</span> B, <span class="keyword">public</span> C {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>{}</span><br><span class="line"></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"D\n"</span>;</span><br><span class="line">	}</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_d;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>此时 A 类的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">class A	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}</span><br><span class="line"> 8	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;A::f</span><br></pre></td></tr></tbody></table></figure>
<p>B 类和 C 类内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br></pre></td><td class="code"><pre><span class="line">class B	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vbptr}</span><br><span class="line"> 8	| m_b</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| {vfptr}</span><br><span class="line">24	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">B::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Bd(B+0)A)</span><br><span class="line">B::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;B::f</span><br><span class="line">B::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br><span class="line"></span><br><span class="line">class C	size(32):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vbptr}</span><br><span class="line"> 8	| m_c</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">16	| {vfptr}</span><br><span class="line">24	| m_a</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">C::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 16 (Cd(C+0)A)</span><br><span class="line">C::$vftable@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;C::f</span><br><span class="line">C::f this adjustor: 16</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      16       0       4 		0</span><br></pre></td></tr></tbody></table></figure>
<p>子类 D 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line">class D	size(64):</span><br><span class="line">	+---</span><br><span class="line"> 0	| {vfptr}		虚函数指针</span><br><span class="line"> 8	| +--- (base class B)</span><br><span class="line"> 8	| | {vbptr}		基类虚基指针</span><br><span class="line">16	| | m_b			基类数据成员</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">24	| +--- (base class C)</span><br><span class="line">24	| | {vbptr}		基类虚基指针</span><br><span class="line">32	| | m_c			基类数据成员</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">40	| m_d			子类数据成员</span><br><span class="line"> 	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">48	| {vfptr}		虚基类虚函数指针</span><br><span class="line">56	| m_a			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">D::$vftable@D@:		类 D 的虚函数表</span><br><span class="line">	| &amp;D_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;D::myVirtual</span><br><span class="line">D::$vbtable@B@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 40 (Dd(B+0)A)		表示类 B 的虚基类 A 位于偏移 40 + 0 = 24 处</span><br><span class="line">D::$vbtable@C@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 24 (Dd(C+0)A)		表示类 C 的虚基类 A 位于偏移 24 + 0 = 24 处</span><br><span class="line">D::$vftable@B@:		类 B 的虚函数表（因为类 B 和类 C 都有一样的函数，虚继承时只保留类 B 的虚函数表）</span><br><span class="line">	| -48</span><br><span class="line"> 0	| &amp;D::f</span><br><span class="line">D::myVirtual this adjustor: 0</span><br><span class="line">D::f this adjustor: 48</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      48       8       4 		0</span><br></pre></td></tr></tbody></table></figure>
<p>再来一个棱形继承：</p>
<figure class="highlight cpp"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">A</span> {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"A\n"</span>;</span><br><span class="line">	}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> val;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">B</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"B\n"</span>;</span><br><span class="line">	}</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">g</span><span class="params">()</span> </span>{}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_b;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">C</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> A {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{</span><br><span class="line">		std::cout &lt;&lt; <span class="string">"C\n"</span>;</span><br><span class="line">	}</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">h</span><span class="params">()</span> </span>{}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_c;</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">D</span> : <span class="keyword">public</span> B, <span class="keyword">public</span> C {</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">myVirtual</span><span class="params">()</span> </span>{}</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">f</span><span class="params">()</span> <span class="keyword">override</span> </span>{}</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">g</span><span class="params">()</span> <span class="keyword">override</span> </span>{}</span><br><span class="line">	<span class="function"><span class="type">void</span> <span class="title">h</span><span class="params">()</span> <span class="keyword">override</span> </span>{}</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line">	<span class="type">int</span> m_d;</span><br><span class="line">};</span><br></pre></td></tr></tbody></table></figure>
<p>针对类 D 的内存布局如下：</p>
<figure class="highlight plaintext"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br></pre></td><td class="code"><pre><span class="line">class D	size(72):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class B)</span><br><span class="line"> 0	| | {vfptr}		基类虚函数指针</span><br><span class="line"> 8	| | {vbptr}		基类虚基指针</span><br><span class="line">16	| | m_b			基类数据成员</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">24	| +--- (base class C)</span><br><span class="line">24	| | {vfptr}		基类虚函数指针</span><br><span class="line">32	| | {vbptr}		基类虚基指针</span><br><span class="line">40	| | m_c			基类数据成员</span><br><span class="line">  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">	| +---</span><br><span class="line">48	| m_d			子类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base A)</span><br><span class="line">56	| {vfptr}		虚基类虚函数指针</span><br><span class="line">64	| val			虚基类数据成员</span><br><span class="line">  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">	+---</span><br><span class="line">D::$vftable@B@:		类 B 的虚函数表</span><br><span class="line">	| &amp;D_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;D::g</span><br><span class="line"> 1	| &amp;D::myVirtual</span><br><span class="line">D::$vftable@C@:		类 C 的虚函数表</span><br><span class="line">	| -24</span><br><span class="line"> 0	| &amp;D::h</span><br><span class="line">D::$vbtable@B@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 48 (Dd(B+8)A)		表示类 B 的虚基类 A 位于偏移 48 + 8 = 56 处</span><br><span class="line">D::$vbtable@C@:</span><br><span class="line"> 0	| -8</span><br><span class="line"> 1	| 24 (Dd(C+8)A)		表示类 C 的虚基类 A 位于偏移 24 + 8 = 32 处</span><br><span class="line">D::$vftable@A@:		类 A 的虚函数表</span><br><span class="line">	| -56</span><br><span class="line"> 0	| &amp;D::f</span><br><span class="line">D::myVirtual this adjustor: 0</span><br><span class="line">D::f this adjustor: 56</span><br><span class="line">D::g this adjustor: 0</span><br><span class="line">D::h this adjustor: 24</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               A      56       8       4 		0</span><br></pre></td></tr></tbody></table></figure>
<p>如果不使用虚继承，出现的问题是：</p>
